const schema = [
  {
    field: "clinic",
    name: "专家门诊"
  },
  {
    field: "name",
    name: "专家"
  },
  {
    field: "hospital",
    name: "所属医院"
  },
  {
    field: "job",
    name: "职称"
  },
  {
    field: "room",
    name: "诊室"
  },
  {
    field: "week",
    name: "门诊时间"
  },
  {
    field: "time",
    name: "具体出诊时间"
  }
]
const data = [
  {
    clinic: "中医针推伤科",
    name: "彭永华",
    hospital: "金山区朱泾社区卫生服务中心",
    job: "主任医师",
    room: "一楼针推伤科门诊2诊室",
	week: "每周六下午",
    time: [[7, 4, 1],[7, 11, 1],[7, 18, 1],[7, 25, 1]],
  },
  {
    clinic: "中医针推伤科",
    name: "徐冲",
    hospital: "松江区方塔中医医院",
    job: "主治医师",
    room: "一楼针推伤科门诊2诊室",
	week: "隔周二下午",
    time: [[7, 14, 1],[7, 28, 1]],
  },
  {
    clinic: "中医皮肤科",
    name: "李苏",
    hospital: "上海市岳阳中西医结合医院",
    job: "副主任医师",
    room: "一楼中医皮肤科诊室",
	week: "周五上午",
    time: [[7, 24, 0]]
  },
  {
    clinic: "中医皮肤科",
    name: "马天",
    hospital: "上海市岳阳中西医结合医院",
    job: "副主任医师",
    room: "一楼中医皮肤科诊室",
	week: "周五上午",
    time: [[7, 10, 0]]
  },
  {
    clinic: "皮肤科",
    name: "陈欢欢",
    hospital: "交医附属松江医院",
    job: "主治医师",
    room: "一楼中医皮肤科诊室",
	week: "周三下午",
    time: [[7, 1, 1],[7, 8, 1],[7, 15, 1],[7, 22, 1],[7, 29, 1]]
  },
  {
    clinic: "皮肤科",
    name: "倪晓青",
    hospital: "交医附属松江医院",
    job: "主治医师",
    room: "一楼中医皮肤科诊室",
	week: "周二上午",
    time: [[7, 7, 0],[7, 14, 0],[7, 21, 0],[7, 28, 0]]
  },
  {
    clinic: "中医内科",
    name: "刘群",
    hospital: "上海长海医院",
    job: "副主任医师",
    room: "一楼中医内科门诊",
	week: "周日上午",
    time: [[7, 12, 0],[7, 26, 0]]
  },
  {
    clinic: "中医妇科",
    name: "刘莹",
    hospital: "松江区方塔中医医院",
    job: "副主任医师",
    room: "一楼中医内科门诊",
	week: "周三上午",
    time: [[7, 1, 0],[7, 8, 0],[7, 15, 0],[7, 22, 0],[7, 29, 0]]
  },
  {
    clinic: "妇科",
    name: "高丽萍",
    hospital: "交医附属松江医院",
    job: "副主任医师",
    room: "一楼妇科门诊",
	week: "周四上午",
    time: [[7, 2, 0],[7, 9, 0],[7, 16, 0],[7, 23, 0],[7, 30, 0]]
  },
  {
    clinic: "儿童康复",
    name: "史惟",
    hospital: "复旦大学附属儿科医院",
    job: "副主任医师",
    room: "一楼康复科",
	week: "周一下午（需提前预约）",
    time: [[7, 13, 1]]
  },
  {
    clinic: "康复科",
    name: "沈勤",
    hospital: "上海市第五康复医院",
    job: "主治医师",
    room: "一楼康复科",
	week: "周二下午",
    time: [[7, 7, 1],[7, 14, 1],[7, 21, 1],[7, 28, 1]]
  },
  {
    clinic: "B超",
    name: "杨峰",
    hospital: "松江区方塔中医医院",
    job: "主治医师",
    room: "一楼B超室",
	week: "周一、周三下午",
    time: [[7, 1, 1],[7, 6, 1],[7, 8, 1],[7, 13, 1],[7, 15, 1],[7, 20, 1],[7, 22, 1],[7, 27, 1],[7, 29, 1]]
  },
  {
    clinic: "外科",
    name: "芮斌",
    hospital: "交医附属松江医院",
    job: "主任医师",
    room: "一楼全科门诊5",
	week: "周四下午",
    time: [[7, 2, 1],[7, 9, 1],[7, 16, 1],[7, 23, 1],[7, 30, 1]]
  },
  {
    clinic: "外科",
    name: "李洋",
    hospital: "交医附属松江医院",
    job: "主治医师",
    room: "一楼全科门诊5",
	week: "周二下午",
    time: [[7, 7, 1],[7, 14, 1],[7, 21, 1],[7, 28, 1]]
  },
  {
    clinic: "肝胆外科",
    name: "孔令群",
    hospital: "上海市第一人民医院松江南院",
    job: "副主任医师",
    room: "一楼全科门诊6",
	week: "周五上午",
    time: [[7, 3, 0],[7, 17, 0],[7, 31, 0]]
  },
  {
    clinic: "肝胆外科",
    name: "付志平",
    hospital: "上海市第一人民医院松江南院",
    job: "主治医师",
    room: "一楼全科门诊6",
	week: "周五上午",
    time: [[7, 10, 0],[7, 24, 0]]
  },
  {
    clinic: "全科",
    name: "松江医院全科专家",
    hospital: "交医附属松江医院",
    job: "/",
    room: "一楼全科门诊6",
	week: "周三下午",
    time: [[7, 1, 1],[7, 8, 1],[7, 15, 1]]
  },
  {
    clinic: "内分泌科",
    name: "金春花",
    hospital: "交医附属松江医院",
    job: "副主任医师",
    room: "二楼全专联合门诊MMC诊室",
	week: "周一下午",
    time: [[7, 6, 1],[7, 13, 1],[7, 27, 1]]
  },
  {
    clinic: "内分泌科",
    name: "陈蕊华/朱立颖",
    hospital: "上海市第一人民医院松江南院",
    job: "副主任医师/主管护师",
    room: "二楼全专联合门诊MMC诊室",
	week: "周三下午",
    time: [[7, 22, 1]]
  },
  {
    clinic: "儿科",
    name: "李臻",
    hospital: "上海市第一人民医院松江南院",
    job: "主任医师",
    room: "二楼全专联合门诊诊室1",
	week: "周一上午",
    time: [[7, 6, 0],[7, 13, 0],[7, 20, 0],[7, 27, 0]]
  },
  {
    clinic: "儿科",
    name: "樊志荣",
    hospital: "交医附属松江医院",
    job: "主任医师",
    room: "二楼全专联合门诊诊室1",
	week: "周四上午",
    time: [[7, 2, 0],[7, 9, 0],[7, 16, 0],[7, 23, 0],[7, 30, 0]]
  },
  {
    clinic: "儿科",
    name: "申建伟",
    hospital: "交医附属松江医院",
    job: "副主任医师",
    room: "二楼全专联合门诊诊室1",
	week: "周二上午",
    time: [[7, 7, 0],[7, 14, 0],[7, 21, 0],[7, 28, 0]]
  },
  {
    clinic: "儿科",
    name: "刘桂芬",
    hospital: "松江区妇幼保健院",
    job: "副主任医师",
    room: "二楼全专联合门诊诊室1",
	week: "周三上午",
    time: [[7, 1, 0],[7, 8, 0],[7, 15, 0],[7, 22, 0],[7, 29, 0]]
  },
  {
    clinic: "儿科",
    name: "沈伟勤",
    hospital: "交医附属松江医院",
    job: "副主任医师",
    room: "二楼全专联合门诊诊室1",
	week: "周日上午",
    time: [[7, 5, 0],[7, 12, 0],[7, 19, 0],[7, 26, 0]]
  },
  {
    clinic: "心血管内科",
    name: "任淑红",
    hospital: "交医附属松江医院",
    job: "副主任医师",
    room: "二楼全专联合门诊诊室2",
	week: "周一上午",
    time: [[7, 6, 0],[7, 13, 0],[7, 20, 0],[7, 27, 0]][[7, 6, 0],[7, 13, 0],[7, 20, 0],[7, 27, 0]]
  },
  {
    clinic: "心血管内科",
    name: "赵晓薇",
    hospital: "交医附属松江医院",
    job: "主治医师",
    room: "二楼全专联合门诊诊室2",
	week: "周三上午",
    time: [[7, 1, 0],[7, 8, 0],[7, 15, 0],[7, 22, 0],[7, 29, 0]]
  },
  {
    clinic: "肾内科",
    name: "臧秀娟",
    hospital: "交医附属松江医院",
    job: "主任医师",
    room: "二楼全专联合门诊诊室2",
	week: "隔周四下午",
    time: [[7, 2, 1],[7, 16, 1],[7, 30, 1]]
  },
  {
    clinic: "神经内科",
    name: "于方苹",
    hospital: "交医附属松江医院",
    job: "主任医师",
    room: "二楼全专联合门诊诊室2",
	week: "周二下午",
    time: [[7, 7, 1],[7, 14, 1],[7, 21, 1],[7, 28, 1]]
  },
  {
    clinic: "消化科",
    name: "任大宾",
    hospital: "交医附属松江医院",
    job: "副主任医师",
    room: "二楼全专联合门诊诊室3",
	week: "第一、第三周周四下午",
    time: [[7, 2, 1],[7, 16, 1]]
  },
  {
    clinic: "耳鼻喉科",
    name: "周斌",
    hospital: "交医附属松江医院",
    job: "副主任医师",
    room: "二楼全专联合门诊诊室4",
	week: "周五上午",
    time: [[7, 3, 0],[7, 10, 0],[7, 17, 0],[7, 24, 0],[7, 31, 0]]
  },
  {
    clinic: "呼吸科",
    name: "李凡",
    hospital: "交医附属松江医院",
    job: "主任医师",
    room: "二楼全专联合门诊诊室4",
	week: "隔周四下午",
    time: [[7, 9, 1],[7, 23, 1]]
  },
  {
    clinic: "眼科",
    name: "唐敏",
    hospital: "上海市第一人民医院松江南院",
    job: "主任医师",
    room: "二楼全专联合门诊MMC诊室",
	week: "第一第三第四周周三下午",
    time: [[7, 1, 1],[7, 15, 1],[7, 22, 1],[7, 29, 1]]
  },
  {
    clinic: "眼科",
    name: "杨爱萍",
    hospital: "交医附属松江医院",
    job: "主治医师",
    room: "二楼全专联合门诊MMC诊室",
	week: "周四下午",
    time: [[7, 2, 1],[7, 9, 1],[7, 16, 1],[7, 23, 1],[7, 30, 1]]
  },
  {
    clinic: "眼科",
    name: "马明明",
    hospital: "上海市第一人民医院松江南院",
    job: "副主任医师",
    room: "二楼全专联合门诊MMC诊室",
	week: "隔周二下午",
    time: [[7, 14, 1]]
  },
  {
    clinic: "精神科",
    name: "陈伯鑫",
    hospital: "松江区精神卫生中心",
    job: "副主任医师",
    room: "北翠路卫生站心理门诊",
	week: "隔周二上午",
    time: [[7, 7, 0],[7, 21, 0]]
  },
  {
    clinic: "口腔科",
    name: "林伟杰",
    hospital: "上海现代齿科医院",
    job: "主治医师",
    room: "三楼口腔科",
	week: "第二周周四",
    time: [[7, 23, 0],[7, 23, 1]]
  },
  {
    clinic: "口腔科",
    name: "张练平",
    hospital: "交医附属松江医院",
    job: "主任医师",
    room: "三楼口腔科",
	week: "周一下午",
    time: [[7, 6, 1],[7, 13, 1],[7, 20, 1],[7, 27, 1]]
  },
]
